/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "Status"; /* Display Name */

"mQr54o" = "unknown";   /* Value: unknown */
"8K78Gu" = "Open";      /* Value: open */
"HSjTOt" = "Completed"; /* Value: completed */
"1Ncljt" = "Canceled";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Things To-Do"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Title";     /* Property: title */
"Kw5NWX" = "List";      /* Property: list */
"R3fuSz" = "When";      /* Property: when */
"8TjwzE" = "Evening";   /* Property: evening */
"gRh7no" = "No";        /* Property: evening (false value) */
"WHB5qC" = "Yes";       /* Property: evening (true value) */
"bww4JS" = "Reminder";  /* Property: reminder */
"19lPBk" = "Deadline";  /* Property: deadline */
"pp3qBd" = "Notes";     /* Property: notes */
"UDIc1x" = "Checklist"; /* Property: checklist */
"KQzIKq" = "Tags";      /* Property: tags */

/* TINList */

"x7Empa" = "Things List"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Add To-Do"; /* Title */
"1Xn7Aa" = "Adds a new to-do to Things."; /* Description */

"YmSQDf" = "To-Do"; /* Parameter: title */
"LHHz9E" = "What's the title?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "List"; /* Parameter: list */
"X4r1DR" = "Which list do you want to add it to?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "When"; /* Parameter: when */
"VkNe0C" = "When do you want to start?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "Evening"; /* Parameter: evening */
"b10WOZ" = "In the evening?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "No"; /* Parameter: evening (false value) */
"KWUIrj" = "Yes"; /* Parameter: evening (true value) */

"AeXgbS" = "Reminder Time"; /* Parameter: reminderTime */
"3Nk1Yl" = "What time do you want to be reminded at?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Deadline"; /* Parameter: deadline */
"xi8sPe" = "What's the deadline?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Tags"; /* Parameter: tags */
"l0xizU" = "What tags should be added?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "Status"; /* Parameter: status */
"sS5Ms4" = "What's the status?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Edit In Things"; /* Parameter: editInThings */
"W5N6Yo" = "Do you want to open Things to edit this to-do?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "No"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Yes"; /* Parameter: editInThings (true value) */

"o8AABR" = "Notes"; /* Parameter: notes */
"pjyLst" = "What notes do you want to add?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Checklist"; /* Parameter: checklist */
"VIitBC" = "What checklist items do you want to add?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} has been added."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} has been added."; /* Response Code: success (printed dialog) */
"sr1IRz" = "There was an error adding the to-do."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "There was an error adding the to-do."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "The to-do has been added."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "The to-do has been added."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "To-Do Title"; /* Response Parameter: todoTitle */
"Br1Zm3" = "To-Do"; /* Response Parameter: todo */

"9LylOv" = "Add ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "Add ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Show To-Do"; /* Title */
"JdIZ8x" = "Shows the specified to-do in Things."; /* Description */

"WAIq5F" = "To-Do"; /* Parameter: todo */

"YIbDyi" = "Show ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Show List"; /* Title */
"xo5PDm" = "Shows the specified list in Things."; /* Description */

"RW2Nyz" = "List"; /* Parameter: list */
"V1nlDA" = "Which list?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Filter by Tags"; /* Parameter: filterByTags */
"HQ0TAS" = "Which tags?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "Show ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "Show ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "Show ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Run Things URL"; /*  Title */
"keYeZ9" = "Runs a Things URL in the background."; /*  Description */

"uPeA3l" = "Things URL"; /*  Parameter: url */
"oTrE0f" = "What's the URL?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "The URL was run successfully."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "The URL was run successfully."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "There was an error running the URL."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "There was an error running the URL."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Run Things URL ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Add Tasks"; /* Title */
"J4CdGj" = "Uses the built-in functionality to add to-dos to Things. Only supports a limited set of parameters."; /* Intent AddTasks -> Description */

"IF3OZi" = "Task List"; /* Parameter: targetTaskList */
"uNB8yE" = "Titles"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Open Things"; /* Suggestions:  (title) */
